-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/06_local_projections.log
  log type:  text
 opened on:   9 Jan 2026, 07:45:57

. 
. ****************************************************
. * 1. Setup and Data Loading
. ****************************************************
. 
. display _n "========================================"

========================================

. display "LOCAL PROJECTIONS: BH SHOCKS TO INEQUALITY"
LOCAL PROJECTIONS: BH SHOCKS TO INEQUALITY

. display "========================================" _n
========================================


. 
. * Load final merged dataset
. use "$deriv/gini_bh_shocks_fred_merged.dta", clear

. 
. * Declare time series
. tsset qdate, quarterly

Time variable: qdate, 1996q1 to 2023q4
        Delta: 1 quarter

. 
. * Verify data structure and check for gaps
. display _n "=== DATA OVERVIEW ==="

=== DATA OVERVIEW ===

. count
  112

. display "Total observations: " r(N)
Total observations: 112

. display "Date range:"
Date range:

. summarize qdate

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       qdate |        112       199.5    32.47563        144        255

. quietly {

. display "First observation: " %tq `first_date'
First observation: 1996q1

. display "Last observation: " %tq `last_date'
Last observation: 2023q4

. 
. * Check for gaps in time series
. display _n "=== CHECKING FOR GAPS IN TIME SERIES ==="

=== CHECKING FOR GAPS IN TIME SERIES ===

. quietly {

. if `n_dups' > 0 {
.     display _n "WARNING: Found duplicate dates!"
.     display "Duplicate quarters:"
.     list qdate year quarter if dup > 0, clean
.     quietly drop dup expected_qdate has_gap
.     display _n "ERROR: Cannot proceed with duplicate dates. Please fix data construction."
.     exit 198
. }

. if `n_gaps' > 0 {
.     display _n "WARNING: Found gaps in time series"
.     display "Missing quarters (expected vs actual):"
.     list qdate expected_qdate year quarter if has_gap, clean
.     display _n "Checking if gaps are at endpoints..."
.     quietly {
.         * Check if first or last expected dates are missing
.         local first_expected = expected_qdate[1]
.         local last_expected = expected_qdate[_N]
.         count if qdate == `first_expected'
.         local has_first = (r(N) > 0)
.         count if qdate == `last_expected'
.         local has_last = (r(N) > 0)
.     }
.     if !`has_first' {
.         display "NOTE: First expected quarter " %tq `first_expected' " is missing (endpoint i
> ssue)"
.     }
.     if !`has_last' {
.         display "NOTE: Last expected quarter " %tq `last_expected' " is missing (endpoint iss
> ue)"
.     }
.     display _n "Filling gaps with missing values (for time series regularity)..."
.     quietly drop expected_qdate has_gap dup
.     tsfill
.     display "Gaps filled. New observation count: " _N
.     display "NOTE: Filled observations have missing values and will be dropped in regressions
> "
. }

. else {
.     display "No gaps detected - time series is regularly spaced"
No gaps detected - time series is regularly spaced
.     quietly drop expected_qdate has_gap dup
. }

. 
. * Re-declare time series after potential filling
. tsset qdate, quarterly

Time variable: qdate, 1996q1 to 2023q4
        Delta: 1 quarter

. 
. * Settings
. local H 20          // horizons (quarters): 0 to 20

. local p 4           // number of lags for controls

. 
. * Shock variables
. local shocks "supply_shock demand_shock_agg demand_shock_oil"

. 
. * Outcome variables
. local outcomes "gini_core gini_broad gini_fincbtax gini_fsalaryx"

. 
. * Macro controls (baseline: log_indpro, infl_core, treasury_1yr)
. local macroctrl "log_indpro infl_core treasury_1yr"

. 
. * Create output directories
. capture mkdir "$paper/Tables"

. capture mkdir "$paper/Figures"

. 
. display _n "=== SPECIFICATION ==="

=== SPECIFICATION ===

. display "Horizons: 0 to `H' quarters"
Horizons: 0 to 20 quarters

. display "Lags: `p' quarters"
Lags: 4 quarters

. display "Outcomes: `outcomes'"
Outcomes: gini_core gini_broad gini_fincbtax gini_fsalaryx

. display "Shocks: `shocks'"
Shocks: supply_shock demand_shock_agg demand_shock_oil

. display "Controls: `macroctrl'"
Controls: log_indpro infl_core treasury_1yr

. display "Form: Cumulative change (y_{t+h} - y_{t-1})"
Form: Cumulative change (y_{t+h} - y_{t-1})

. 
. ****************************************************
. * 2. Local Projections Loop
. ****************************************************
. 
. display _n "=== ESTIMATING LOCAL PROJECTIONS ==="

=== ESTIMATING LOCAL PROJECTIONS ===

. 
. * Create postfile to store results
. tempfile results

. postfile IRF str20 outcome str50 outcome_label int h ///
>     str20 shock_type str50 shock_label ///
>     double coefficient double se double ci_lower double ci_upper ///
>     using `results', replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_28270.000001 not found)

. 
. * Loop over outcomes
. foreach y of local outcomes {
  2.     
.     * Get outcome label
.     local ylabel : variable label `y'
  3.     if "`ylabel'" == "" {
  4.         local ylabel "`y'"
  5.     }
  6.     
.     display _n "----------------------------------------"
  7.     display "Estimating LP for: `y'"
  8.     display "Label: `ylabel'"
  9.     display "----------------------------------------"
 10.     
.     * Loop over horizons
.     forvalues h = 0/`H' {
 11.         
.         quietly {
 12.             * Create cumulative change: y_{t+h} - y_{t-1}
.             gen dyh = F`h'.`y' - L.`y'
 13.             
.             * LP regression with Newey-West HAC standard errors
.             * Controls: lags of outcome + lags of macro vars
.             * Use lag(h) to account for horizon-dependent autocorrelation
.             local nwlag = `h'
 14.             newey dyh ///
>                 `shocks' ///
>                 L(1/`p').`y' ///
>                 L(1/`p').(`macroctrl') ///
>                 , lag(`nwlag')
 15.             
.             * Store coefficients and SEs for each shock
.             foreach shock of local shocks {
 16.                 local b = _b[`shock']
 17.                 local se = _se[`shock']
 18.                 local ci_lower = `b' - 1.96*`se'
 19.                 local ci_upper = `b' + 1.96*`se'
 20.                 
.                 * Get shock label
.                 local shocklabel : variable label `shock'
 21.                 if "`shocklabel'" == "" {
 22.                     if "`shock'" == "supply_shock" {
 23.                         local shocklabel "BH Oil Supply Shock"
 24.                     }
 25.                     else if "`shock'" == "demand_shock_agg" {
 26.                         local shocklabel "BH Aggregate Demand Shock"
 27.                     }
 28.                     else if "`shock'" == "demand_shock_oil" {
 29.                         local shocklabel "BH Oil Consumption Demand Shock"
 30.                     }
 31.                     else {
 32.                         local shocklabel "`shock'"
 33.                     }
 34.                 }
 35.                 
.                 * Post results
.                 post IRF ("`y'") ("`ylabel'") (`h') ///
>                     ("`shock'") ("`shocklabel'") ///
>                     (`b') (`se') (`ci_lower') (`ci_upper')
 36.             }
 37.             
.             drop dyh
 38.         }
 39.         
.         * Progress indicator every 5 horizons
.         if mod(`h', 5) == 0 {
 40.             display "  Horizon `h' complete"
 41.         }
 42.     }
 43.     
.     display "  Completed all horizons for `y'"
 44. }

----------------------------------------
Estimating LP for: gini_core
Label: Gini coefficient - core consumption
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_core

----------------------------------------
Estimating LP for: gini_broad
Label: Gini coefficient - broad consumption
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_broad

----------------------------------------
Estimating LP for: gini_fincbtax
Label: Gini coefficient - income before taxes
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_fincbtax

----------------------------------------
Estimating LP for: gini_fsalaryx
Label: Gini coefficient - salary income
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_fsalaryx

. 
. postclose IRF

. 
. display _n "=== ESTIMATION COMPLETE ==="

=== ESTIMATION COMPLETE ===

. 
. ****************************************************
. * 3. Load and Process Results
. ****************************************************
. 
. use `results', clear

. 
. * Rename h to horizon for clarity
. rename h horizon

. 
. * Sort for easier viewing
. sort outcome shock_type horizon

. 
. * Display summary
. display _n "=== RESULTS SUMMARY ==="

=== RESULTS SUMMARY ===

. count
  252

. display "Total IRF estimates: " r(N)
Total IRF estimates: 252

. display "Breakdown:"
Breakdown:

. tab outcome shock_type

                     |            shock_type
             outcome | demand_..  demand_..  supply_.. |     Total
---------------------+---------------------------------+----------
          gini_broad |        21         21         21 |        63 
           gini_core |        21         21         21 |        63 
       gini_fincbtax |        21         21         21 |        63 
       gini_fsalaryx |        21         21         21 |        63 
---------------------+---------------------------------+----------
               Total |        84         84         84 |       252 

. 
. ****************************************************
. * 4. Export Results Table
. ****************************************************
. 
. display _n "=== EXPORTING RESULTS TABLE ==="

=== EXPORTING RESULTS TABLE ===

. 
. * Export to CSV with descriptive headers
. export delimited using "$paper/Tables/lp_irf_results.csv", replace
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Tables/lp_irf_results.csv saved

. 
. display "Saved: $paper/Tables/lp_irf_results.csv"
Saved: /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Tables/lp_irf_results.csv

. 
. ****************************************************
. * 5. Create IRF Plots
. ****************************************************
. 
. display _n "=== CREATING IRF PLOTS ==="

=== CREATING IRF PLOTS ===

. 
. * Get list of outcomes
. levelsof outcome, local(outlist)
`"gini_broad"' `"gini_core"' `"gini_fincbtax"' `"gini_fsalaryx"'

. 
. * Get list of shocks
. levelsof shock_type, local(shocklist)
`"demand_shock_agg"' `"demand_shock_oil"' `"supply_shock"'

. 
. * Create plots for each outcome-shock combination
. foreach y of local outlist {
  2.     
.     foreach shock of local shocklist {
  3.         
.         preserve
  4.         keep if outcome == "`y'" & shock_type == "`shock'"
  5.         
.         * Get outcome label from first observation
.         quietly {
  6.             local ylabel = outcome_label[1]
  7.         }
  8.         
.         * Create short shock label for title
.         if "`shock'" == "supply_shock" {
  9.             local shocklabel_short "supply shock"
 10.         }
 11.         else if "`shock'" == "demand_shock_agg" {
 12.             local shocklabel_short "demand shock (agg)"
 13.         }
 14.         else if "`shock'" == "demand_shock_oil" {
 15.             local shocklabel_short "demand shock"
 16.         }
 17.         else {
 18.             local shocklabel_short "`shock'"
 19.         }
 20.         
.         * Create plot title
.         local plottitle "`ylabel' to `shocklabel_short'"
 21.         
.         * Determine file name based on shock type
.         if "`shock'" == "supply_shock" {
 22.             local shockname "supply"
 23.         }
 24.         else if "`shock'" == "demand_shock_agg" {
 25.             local shockname "dagg"
 26.         }
 27.         else if "`shock'" == "demand_shock_oil" {
 28.             local shockname "doil"
 29.         }
 30.         else {
 31.             local shockname = subinstr("`shock'", "_", "", .)
 32.         }
 33.         
.         * Generate zero line variable
.         gen zero_line = 0
 34.         
.         * Create plot with confidence bands and zero line
.         twoway ///
>             (rarea ci_upper ci_lower horizon, color(gs12) fintensity(30)) ///
>             (line coefficient horizon, lwidth(medthick) lcolor(navy)) ///
>             (line zero_line horizon, lpattern(dash) lcolor(black) lwidth(thin)) ///
>             , title("`plottitle'", size(med)) ///
>               xtitle("Horizon (quarters)", size(med)) ///
>               ytitle("", size(med)) ///
>               legend(order(2 "Point Estimate" 1 "95% Confidence Interval") ///
>                      cols(2) size(small)) ///
>               xlabel(0(5)20, grid) ///
>               ylabel(, grid) ///
>               scheme(s1mono) ///
>               plotregion(margin(small)) ///
>               graphregion(margin(medium) color(white))
 35.         
.         * Save plot
.         local filename "irf_`shockname'_`y'.png"
 36.         graph export "$paper/Figures/`filename'", replace width(2000)
 37.         
.         display "  Saved: `filename'"
 38.         
.         restore
 39.     }
 40. }
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_dagg_gini_broad.png
    saved as PNG format
  Saved: irf_dagg_gini_broad.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_doil_gini_broad.png
    saved as PNG format
  Saved: irf_doil_gini_broad.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_supply_gini_broad.png
    saved as PNG format
  Saved: irf_supply_gini_broad.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_dagg_gini_core.png saved
    as PNG format
  Saved: irf_dagg_gini_core.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_doil_gini_core.png saved
    as PNG format
  Saved: irf_doil_gini_core.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_supply_gini_core.png
    saved as PNG format
  Saved: irf_supply_gini_core.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_dagg_gini_fincbtax.png
    saved as PNG format
  Saved: irf_dagg_gini_fincbtax.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_doil_gini_fincbtax.png
    saved as PNG format
  Saved: irf_doil_gini_fincbtax.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_supply_gini_fincbtax.png
    saved as PNG format
  Saved: irf_supply_gini_fincbtax.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_dagg_gini_fsalaryx.png
    saved as PNG format
  Saved: irf_dagg_gini_fsalaryx.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_doil_gini_fsalaryx.png
    saved as PNG format
  Saved: irf_doil_gini_fsalaryx.png
(231 observations deleted)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
(note:  named style med not found in class gsize, default attributes used)
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_supply_gini_fsalaryx.png
    saved as PNG format
  Saved: irf_supply_gini_fsalaryx.png

. 
. display _n "=== ALL PLOTS CREATED ==="

=== ALL PLOTS CREATED ===

. 
. ****************************************************
. * 6. Final Summary
. ****************************************************
. 
. display _n "========================================"

========================================

. display "LOCAL PROJECTIONS COMPLETE"
LOCAL PROJECTIONS COMPLETE

. display "========================================"
========================================

. display "Results table: $paper/Tables/lp_irf_results.csv"
Results table: /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Tables/lp_irf_results.csv

. display "IRF plots: $paper/Figures/irf_*.png"
IRF plots: /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Paper/Figures/irf_*.png

. display "Total plots created: 12 (3 shocks × 4 outcomes)"
Total plots created: 12 (3 shocks × 4 outcomes)

. display "========================================" _n
========================================


. 
. * Close log file
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/06_local_projections.log
  log type:  text
 closed on:   9 Jan 2026, 07:46:12
-----------------------------------------------------------------------------------------------
