---------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/01_m
> erge_cgk_shocks.log
  log type:  text
 opened on:  19 Jan 2026, 19:30:02

. 
. display _n "========================================"

========================================

. display "MERGING CGK SHOCKS WITH GINI DATA"
MERGING CGK SHOCKS WITH GINI DATA

. display "========================================" _n
========================================


. 
. ****************************************************
. * 1. Import Romer-Romer (RR) Shocks
. ****************************************************
. display _n "=== Importing RR Shocks ==="

=== Importing RR Shocks ===

. 
. use "$cgk_source/RR_shocks_updated.dta", clear

. 
. * Check structure
. display "RR shocks structure:"
RR shocks structure:

. describe

Contains data from /Volumes/SSD PRO/Downloads/replication_folder/source_fil
> es/RR_shocks_updated.dta
 Observations:           160                  
    Variables:             3                  2 Apr 2015 08:58
---------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------
year            int     %8.0g                 
quarter         byte    %8.0g                 
sh_rr           float   %8.0g                 Quarterly Frequency
---------------------------------------------------------------------------
Sorted by: 

. count
  160

. display "First 10 observations:"
First 10 observations:

. list in 1/10

     +---------------------------+
     | year   quarter      sh_rr |
     |---------------------------|
  1. | 1969         1   -.223773 |
  2. | 1969         2    .709844 |
  3. | 1969         3    .512867 |
  4. | 1969         4    .221164 |
  5. | 1970         1   -.564137 |
     |---------------------------|
  6. | 1970         2   -.026699 |
  7. | 1970         3    -.90813 |
  8. | 1970         4   -.626424 |
  9. | 1971         1    -.82875 |
 10. | 1971         2    .941407 |
     +---------------------------+

. 
. * Check if already has year/quarter or needs conversion
. capture confirm variable year

. if _rc {
.     * Need to create year/quarter from date variable
.     * Check what date variable exists
.     describe
.     * Assuming there's a date variable - adjust based on actual structure
.     * For now, assume it has year and quarter already
.     display "WARNING: No year/quarter found. Please check RR_shocks_updat
> ed.dta structure"
. }

. 
. * Ensure we have year and quarter
. capture confirm variable year quarter

. if _rc {
.     * Try to infer from other variables
.     * This will need adjustment based on actual file structure
.     display "ERROR: Cannot find year/quarter in RR shocks. Please check f
> ile structure."
.     exit 198
. }

. 
. * Create qdate for merging
. gen qdate = yq(year, quarter)

. format qdate %tq

. 
. * Rename shock variable to match CGK convention
. capture confirm variable sh_rr

. if _rc {
.     * Check what the shock variable is actually named
.     describe
.     * If it's named differently, rename it
.     * Common names: RR_shock, shock, etc.
.     capture rename RR_shock sh_rr
.     capture rename shock sh_rr
.     if _rc {
.         display "WARNING: Could not find RR shock variable. Please check 
> variable names."
.     }
. }

. 
. * Keep only necessary variables
. keep year quarter qdate sh_rr

. 
. * Save temporary file
. tempfile rr_shocks

. save `rr_shocks'
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_00689.000001
    saved as .dta format

. 
. display "RR shocks: " _N " quarterly observations"
RR shocks: 160 quarterly observations

. summarize sh_rr

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       sh_rr |        160   -7.07e-10    .5880398  -4.066539   2.508507

. 
. ****************************************************
. * 2. Import Gorodnichenko-Weber Fed Funds Futures Shocks
. ****************************************************
. display _n "=== Importing Gorodnichenko-Weber Fed Funds Futures Shocks ==
> ="

=== Importing Gorodnichenko-Weber Fed Funds Futures Shocks ===

. 
. import excel "$cgk_source/Gorodnichenko_Weber_fed_funds_futures_shocks.xl
> sx", ///
>     sheet("shocks") cellrange(A1) firstrow clear
(2 vars, 137 obs)

. 
. * Check structure
. display "Gorodnichenko-Weber shocks structure:"
Gorodnichenko-Weber shocks structure:

. describe

Contains data
 Observations:           137                  
    Variables:             2                  
---------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------
DATE            int     %td..                 DATE
TIGHT_SHOCK     double  %10.0g                TIGHT_SHOCK
---------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. count
  137

. display "First 10 observations:"
First 10 observations:

. list in 1/10

     +-----------------------+
     |       DATE   TIGHT_~K |
     |-----------------------|
  1. |   2/4/1994       .163 |
  2. |  3/22/1994          0 |
  3. |  4/18/1994        .15 |
  4. |  5/17/1994       .111 |
  5. |   7/6/1994       -.05 |
     |-----------------------|
  6. |  8/16/1994       .124 |
  7. |  9/27/1994       -.09 |
  8. | 11/15/1994        .12 |
  9. | 12/20/1994      -.226 |
 10. |   2/1/1995       .062 |
     +-----------------------+

. 
. * Rename TIGHT_SHOCK to MP_FFF_GW
. capture rename TIGHT_SHOCK MP_FFF_GW

. if _rc {
.     display "WARNING: TIGHT_SHOCK variable not found. Checking available 
> variables:"
.     describe
. }

. 
. * Parse DATE variable to year, month, quarter
. * DATE should be a Stata date variable or Excel date
. capture confirm variable DATE

. if _rc {
.     display "ERROR: DATE variable not found in Gorodnichenko-Weber shocks
> "
.     exit 198
. }

. 
. * Convert DATE to Stata date if needed
. capture confirm numeric variable DATE

. if _rc {
.     * DATE might be string or Excel date number
.     * Try to convert
.     capture destring DATE, replace
.     if _rc {
.         * Try as Excel date
.         gen date_num = DATE
.         replace date_num = date_num - 25569 if date_num > 25569
.         gen DATE_stata = date_num
.         format DATE_stata %td
.         drop DATE
.         rename DATE_stata DATE
.     }
. }

. 
. * Extract year, month, quarter
. gen year = year(DATE)

. gen month = month(DATE)

. gen quarter = quarter(DATE)

. 
. * Collapse to quarterly (sum monthly shocks within quarter)
. collapse (sum) MP_FFF_GW, by(year quarter)

. 
. * Create qdate for merging
. gen qdate = yq(year, quarter)

. format qdate %tq

. 
. * Save temporary file
. tempfile gw_shocks

. save `gw_shocks'
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_00689.000002
    saved as .dta format

. 
. display "Gorodnichenko-Weber shocks: " _N " quarterly observations"
Gorodnichenko-Weber shocks: 64 quarterly observations

. summarize MP_FFF_GW

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   MP_FFF_GW |         64   -.0342019    .1192974       -.43       .261

. 
. ****************************************************
. * 3. Import Trend Inflation Shocks
. ****************************************************
. display _n "=== Importing Trend Inflation Shocks ==="

=== Importing Trend Inflation Shocks ===

. 
. import excel "$cgk_source/Trend_inflation_shocks_CG.xlsx", ///
>     sheet("Sheet1") cellrange(A1) firstrow clear
(6 vars, 160 obs)

. 
. * Check structure
. display "Trend inflation shocks structure:"
Trend inflation shocks structure:

. describe

Contains data
 Observations:           160                  
    Variables:             6                  
---------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------
year            int     %10.0g                year
quarter         byte    %10.0g                quarter
sh_pi           double  %10.0g                sh_pi
PI_STAR_IRL_B~K double  %10.0g                PI_STAR_IRL_BACK
PI_TARGET       double  %10.0g                PI_TARGET
pi_trend_cg     double  %10.0g                pi_trend_cg
---------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. count
  160

. display "First 10 observations:"
First 10 observations:

. list in 1/10

     +---------------------------------------------------------------+
     | year   quarter        sh_pi   PI_STA~K   PI_TAR~T   pi_tren~g |
     |---------------------------------------------------------------|
  1. | 1969         1            .      3.864     3.8302    2.983751 |
  2. | 1969         2   -.04285699      3.984     3.9004    2.940894 |
  3. | 1969         3    .01612809      4.144     3.9928    2.957022 |
  4. | 1969         4    .05180172      4.144     3.9366   3.0088238 |
  5. | 1970         1    .06984539      4.384     3.9872   3.0786692 |
     |---------------------------------------------------------------|
  6. | 1970         2    .13972617      4.504      4.016   3.2183953 |
  7. | 1970         3    .11633257      4.304     3.9074   3.3347279 |
  8. | 1970         4    .10421202      4.664     3.9776   3.4389399 |
  9. | 1971         1    .07090528      4.864     4.2214   3.5098452 |
 10. | 1971         2    .06850937      4.704      4.122   3.5783546 |
     +---------------------------------------------------------------+

. 
. * Variables should be: pi_trend_cg, PI_TARGET, PI_STAR_IRL_BACK
. * Check if they exist
. capture confirm variable pi_trend_cg PI_TARGET PI_STAR_IRL_BACK

. if _rc {
.     display "WARNING: Some trend inflation variables not found. Available
>  variables:"
.     describe
. }

. 
. * Check if already has year/quarter or needs conversion
. capture confirm variable year quarter

. if _rc {
.     * Need to create from date variable
.     * Check what date variable exists
.     describe
.     * Assuming there's a date variable - adjust based on actual structure
.     display "WARNING: No year/quarter found. Please check Trend_inflation
> _shocks_CG.xlsx structure"
.     * For now, try to infer from other variables or exit with error
.     exit 198
. }

. 
. * Create qdate for merging
. gen qdate = yq(year, quarter)

. format qdate %tq

. 
. * Keep only necessary variables
. keep year quarter qdate pi_trend_cg PI_TARGET PI_STAR_IRL_BACK

. 
. * Save temporary file
. tempfile trend_shocks

. save `trend_shocks'
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_00689.000003
    saved as .dta format

. 
. display "Trend inflation shocks: " _N " quarterly observations"
Trend inflation shocks: 160 quarterly observations

. summarize pi_trend_cg PI_TARGET PI_STAR_IRL_BACK

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 pi_trend_cg |        160    4.048573    1.901962   1.986705   9.033938
   PI_TARGET |        140    3.249364    1.292846     1.4178     5.9812
PI_STAR_IR~K |        142    4.011042    1.779407      1.784      7.144

. 
. ****************************************************
. * 4. Merge all shocks together
. ****************************************************
. display _n "=== Merging All Shocks ==="

=== Merging All Shocks ===

. 
. use `rr_shocks', clear

. 
. * Merge with Gorodnichenko-Weber shocks
. merge 1:1 qdate using `gw_shocks'
(variable year was int, now float to accommodate using data's values)
(variable quarter was byte, now float to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           104
        from master                       100  (_merge==1)
        from using                          4  (_merge==2)

    Matched                                60  (_merge==3)
    -----------------------------------------

. display "Merge with GW shocks:"
Merge with GW shocks:

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |        100       60.98       60.98
         Using only (2) |          4        2.44       63.41
            Matched (3) |         60       36.59      100.00
------------------------+-----------------------------------
                  Total |        164      100.00

. drop _merge

. 
. * Merge with trend inflation shocks
. merge 1:1 qdate using `trend_shocks'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             4
        from master                         4  (_merge==1)
        from using                          0  (_merge==2)

    Matched                               160  (_merge==3)
    -----------------------------------------

. display "Merge with trend inflation shocks:"
Merge with trend inflation shocks:

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |          4        2.44        2.44
            Matched (3) |        160       97.56      100.00
------------------------+-----------------------------------
                  Total |        164      100.00

. drop _merge

. 
. * Sort by date
. sort qdate

. 
. * Save combined shocks
. save "$robust_data/cgk_shocks_quarterly.dta", replace
file /Volumes/SSD
    PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Data/cgk_shocks_quarterl
    > y.dta saved

. 
. display _n "Combined shocks summary:"

Combined shocks summary:

. count
  164

. summarize qdate

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       qdate |        164       117.5    47.48684         36        199

. summarize sh_rr MP_FFF_GW pi_trend_cg

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       sh_rr |        160   -7.07e-10    .5880398  -4.066539   2.508507
   MP_FFF_GW |         64   -.0342019    .1192974       -.43       .261
 pi_trend_cg |        160    4.048573    1.901962   1.986705   9.033938

. 
. ****************************************************
. * 5. Load our quarterly Gini data
. ****************************************************
. display _n "=== Loading Gini Data ==="

=== Loading Gini Data ===

. 
. use "$deriv/gini_1990_2023_quarterly.dta", clear

. 
. display "Gini data:"
Gini data:

. count
  136

. summarize qdate

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       qdate |        136       187.5    39.40389        120        255

. display "Date range: " %tq qdate[1] " to " %tq qdate[_N]
Date range: 1990q1 to 2023q4

. 
. ****************************************************
. * 6. Merge shocks with Gini data
. ****************************************************
. display _n "=== Merging Shocks with Gini Data ==="

=== Merging Shocks with Gini Data ===

. 
. * Merge on qdate
. merge 1:1 qdate using "$robust_data/cgk_shocks_quarterly.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                           140
        from master                        56  (_merge==1)
        from using                         84  (_merge==2)

    Matched                                80  (_merge==3)
    -----------------------------------------

. 
. display "Merge results:"
Merge results:

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        Master only (1) |         56       25.45       25.45
         Using only (2) |         84       38.18       63.64
            Matched (3) |         80       36.36      100.00
------------------------+-----------------------------------
                  Total |        220      100.00

. display _n "Sample of matched observations:"

Sample of matched observations:

. list qdate year quarter gini_core gini_broad sh_rr MP_FFF_GW pi_trend_cg 
> if _merge == 3 in 1/10

     +------------------------------------------------------------+
  1. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1990q1 | 1990 |       1 | .56984676 |  .5069772 |  .224425 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.5898615           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  2. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1990q2 | 1990 |       2 |  .5717588 | .50904219 |  .032958 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.5798018           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  3. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1990q3 | 1990 |       3 | .58059137 | .51961611 |  .064119 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.5588166           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  4. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1990q4 | 1990 |       4 | .55939284 | .50638934 | -.108631 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.5315597           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  5. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1991q1 | 1991 |       1 | .54519671 | .48697029 |  .060211 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.5051486           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  6. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1991q2 | 1991 |       2 | .55347773 | .49780022 |  .237693 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.4943792           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  7. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1991q3 | 1991 |       3 | .55646256 | .50317176 |   .08818 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.4813498           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  8. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1991q4 | 1991 |       4 | .56161073 | .50537621 |  .067731 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.4493873           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
  9. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1992q1 | 1992 |       1 | .54394985 | .48774133 |  .028344 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.4110465           |
     +------------------------------------------------------------+

     +------------------------------------------------------------+
 10. |  qdate | year | quarter | gini_core | gini_br~d |    sh_rr |
     | 1992q2 | 1992 |       2 | .55798696 | .49963496 |  .159284 |
     |------------------------------------------------------------|
     |          MP_FFF~W           |          pi_tren~g           |
     |                 .           |          3.3945031           |
     +------------------------------------------------------------+

. 
. display _n "Sample of Gini-only (unmatched):"

Sample of Gini-only (unmatched):

. count if _merge == 1
  56

. if r(N) > 0 {
.     list qdate year quarter if _merge == 1 in 1/10
. }

. 
. display _n "Sample of shocks-only (unmatched):"

Sample of shocks-only (unmatched):

. count if _merge == 2
  84

. if r(N) > 0 {
.     list qdate year quarter if _merge == 2 in 1/10
. }

. 
. * Keep all Gini observations (shocks will be missing for 2009-2023, which
>  is expected)
. * For LP analysis, we'll use overlapping period 1990-2008
. keep if _merge == 1 | _merge == 3
(84 observations deleted)

. drop _merge

. 
. * Sort and order variables
. sort qdate

. order qdate year quarter gini_core gini_broad gini_fincbtax gini_fsalaryx
>  ///
>     sh_rr MP_FFF_GW pi_trend_cg PI_TARGET PI_STAR_IRL_BACK

. 
. * Add variable labels
. label var sh_rr "Romer-Romer monetary policy shock"

. label var MP_FFF_GW "Gorodnichenko-Weber fed funds futures shock"

. label var pi_trend_cg "Coibion-Gorodnichenko trend inflation shock"

. label var PI_TARGET "Inflation target: Cogley-Primiceri-Sargent"

. label var PI_STAR_IRL_BACK "Inflation target: Ireland"

. 
. * Save final merged dataset
. save "$robust_data/gini_cgk_shocks_merged.dta", replace
file /Volumes/SSD
    PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Data/gini_cgk_shocks_mer
    > ged.dta saved

. 
. display _n "========================================"

========================================

. display "MERGE COMPLETE"
MERGE COMPLETE

. display "========================================"
========================================

. display "Saved: $robust_data/gini_cgk_shocks_merged.dta"
Saved: /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Data/gini_
> cgk_shocks_merged.dta

. display "Total observations: " _N
Total observations: 136

. display "Date range: " %tq qdate[1] " to " %tq qdate[_N]
Date range: 1990q1 to 2023q4

. display _n "Overlapping period (1990-2008) for LP analysis:"

Overlapping period (1990-2008) for LP analysis:

. count if year >= 1990 & year <= 2008 & !missing(sh_rr)
  76

. display "  Observations with RR shocks: " r(N)
  Observations with RR shocks: 76

. count if year >= 1990 & year <= 2008 & !missing(MP_FFF_GW)
  60

. display "  Observations with GW shocks: " r(N)
  Observations with GW shocks: 60

. count if year >= 1990 & year <= 2008 & !missing(pi_trend_cg)
  76

. display "  Observations with trend inflation shocks: " r(N)
  Observations with trend inflation shocks: 76

. 
. display _n "First 10 observations:"

First 10 observations:

. list in 1/10

     +-------------------------------------------------------------------+
  1. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1990q1  | 1990  |       1  | .56984676  |  .5069772  | .45229642  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .43143236 |  .224425 |        . | 3.5898615 |   3.3998 |    3.544 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  2. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1990q2  | 1990  |       2  |  .5717588  | .50904219  | .45079089  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .43084365 |  .032958 |        . | 3.5798018 |   3.3531 |    3.504 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  3. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1990q3  | 1990  |       3  | .58059137  | .51961611  | .44345266  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .42074145 |  .064119 |        . | 3.5588166 |   3.2424 |    3.304 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  4. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1990q4  | 1990  |       4  | .55939284  | .50638934  | .45369446  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .42468012 | -.108631 |        . | 3.5315597 |   3.1036 |    3.184 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  5. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1991q1  | 1991  |       1  | .54519671  | .48697029  | .45363992  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .42249138 |  .060211 |        . | 3.5051486 |   3.1035 |    3.424 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  6. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1991q2  | 1991  |       2  | .55347773  | .49780022  | .44686976  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .41518436 |  .237693 |        . | 3.4943792 |    2.917 |    3.104 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  7. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1991q3  | 1991  |       3  | .55646256  | .50317176  | .44794039  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .41614584 |   .08818 |        . | 3.4813498 |   2.7636 |    3.144 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  8. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1991q4  | 1991  |       4  | .56161073  | .50537621  | .46051872  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .43409921 |  .067731 |        . | 3.4493873 |   2.6497 |    2.984 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
  9. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1992q1  | 1992  |       1  | .54394985  | .48774133  | .45725023  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .42912614 |  .028344 |        . | 3.4110465 |   2.6117 |    2.944 |
     +-------------------------------------------------------------------+

     +-------------------------------------------------------------------+
 10. |  qdate  | year  | quarter  | gini_core  | gini_br~d  | gini_fi~x  |
     | 1992q2  | 1992  |       2  | .55798696  | .49963496  | .45564744  |
     |-------------------------------------------------------------------|
     | gini_fs~x |    sh_rr | MP_FFF~W | pi_tren~g | PI_TAR~T | PI_STA~K |
     | .42171684 |  .159284 |        . | 3.3945031 |   2.5078 |    2.824 |
     +-------------------------------------------------------------------+

. 
. * Close log file
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/01_m
> erge_cgk_shocks.log
  log type:  text
 closed on:  19 Jan 2026, 19:30:02
---------------------------------------------------------------------------
