---------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/03_l
> ocal_projections_rr_baseline.log
  log type:  text
 opened on:  20 Jan 2026, 12:17:12

. 
. display _n "========================================"

========================================

. display "LOCAL PROJECTIONS: RR SHOCKS TO INEQUALITY (BASELINE)"
LOCAL PROJECTIONS: RR SHOCKS TO INEQUALITY (BASELINE)

. display "========================================" _n
========================================


. 
. ****************************************************
. * 1. Setup and Data Loading
. ****************************************************
. 
. * Load merged dataset
. use "$robust_data/gini_rr_merged_baseline.dta", clear

. 
. * Declare time series (qdate already in Gini panel)
. tsset qdate, quarterly

Time variable: qdate, 1996q1 to 2008q4
        Delta: 1 quarter

. 
. display _n "=== DATA OVERVIEW ==="

=== DATA OVERVIEW ===

. count
  52

. display "Total observations: " r(N)
Total observations: 52

. display "Date range:"
Date range:

. summarize qdate

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       qdate |         52       169.5    15.15476        144        195

. quietly {

. display "First observation: " %tq `first_date'
First observation: 1996q1

. display "Last observation:  " %tq `last_date'
Last observation:  2008q4

. 
. ****************************************************
. * 2. LP Specification
. ****************************************************
. 
. local H 20          // horizons (quarters): 0 to 20

. local p 4           // number of lags for controls

. 
. * Shock
. local shocks "sh_rr"

. 
. * Outcomes: 4 Ginis
. local outcomes "gini_core gini_broad gini_fincbtax gini_fsalaryx"

. 
. display _n "=== SPECIFICATION ==="

=== SPECIFICATION ===

. display "Horizons: 0 to `H' quarters"
Horizons: 0 to 20 quarters

. display "Lags:     `p' quarters"
Lags:     4 quarters

. display "Outcomes: `outcomes'"
Outcomes: gini_core gini_broad gini_fincbtax gini_fsalaryx

. display "Shock:    `shocks'"
Shock:    sh_rr

. display "Controls: lags of outcome only"
Controls: lags of outcome only

. display "Form:     Cumulative change (y_{t+h} - y_{t-1})"
Form:     Cumulative change (y_{t+h} - y_{t-1})

. 
. ****************************************************
. * 3. Local Projections Loop
. ****************************************************
. 
. display _n "=== ESTIMATING LOCAL PROJECTIONS ==="

=== ESTIMATING LOCAL PROJECTIONS ===

. 
. tempfile results

. postfile IRF str20 outcome str50 outcome_label int h ///
>     str20 shock_type str50 shock_label ///
>     double coefficient double se double ci_lower double ci_upper ///
>     using `results', replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_06628.000001
    not found)

. 
. foreach y of local outcomes {
  2. 
.     * Get outcome label
.     local ylabel : variable label `y'
  3.     if "`ylabel'" == "" {
  4.         local ylabel "`y'"
  5.     }
  6. 
.     display _n "----------------------------------------"
  7.     display "Estimating LP for: `y'"
  8.     display "Label:            `ylabel'"
  9.     display "----------------------------------------"
 10. 
.     forvalues h = 0/`H' {
 11. 
.         quietly {
 12.             * Cumulative change: y_{t+h} - y_{t-1}
.             gen dyh = F`h'.`y' - L.`y'
 13. 
.             * LP regression with Newey-West HAC standard errors
.             local nwlag = `h'
 14.             newey dyh ///
>                 `shocks' ///
>                 L(1/`p').`y' ///
>                 , lag(`nwlag')
 15. 
.             * Store coefficients and SEs for each shock
.             foreach shock of local shocks {
 16.                 local b        = _b[`shock']
 17.                 local se       = _se[`shock']
 18.                 local ci_lower = `b' - 1.96*`se'
 19.                 local ci_upper = `b' + 1.96*`se'
 20. 
.                 * Shock label
.                 local shocklabel : variable label `shock'
 21.                 if "`shocklabel'" == "" {
 22.                     local shocklabel "RR Greenbook shock"
 23.                 }
 24. 
.                 post IRF ("`y'") ("`ylabel'") (`h') ///
>                     ("`shock'") ("`shocklabel'") ///
>                     (`b') (`se') (`ci_lower') (`ci_upper')
 25.             }
 26. 
.             drop dyh
 27.         }
 28. 
.         if mod(`h', 5) == 0 {
 29.             display "  Horizon `h' complete"
 30.         }
 31.     }
 32. 
.     display "  Completed all horizons for `y'"
 33. }

----------------------------------------
Estimating LP for: gini_core
Label:            Gini coefficient - core consumption
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_core

----------------------------------------
Estimating LP for: gini_broad
Label:            Gini coefficient - broad consumption
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_broad

----------------------------------------
Estimating LP for: gini_fincbtax
Label:            Gini coefficient - income before taxes
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_fincbtax

----------------------------------------
Estimating LP for: gini_fsalaryx
Label:            Gini coefficient - salary income
----------------------------------------
  Horizon 0 complete
  Horizon 5 complete
  Horizon 10 complete
  Horizon 15 complete
  Horizon 20 complete
  Completed all horizons for gini_fsalaryx

. 
. postclose IRF

. 
. display _n "=== ESTIMATION COMPLETE ==="

=== ESTIMATION COMPLETE ===

. 
. ****************************************************
. * 4. Process and Export Results
. ****************************************************
. 
. use `results', clear

. 
. rename h horizon

. sort outcome shock_type horizon

. 
. display _n "=== RESULTS SUMMARY ==="

=== RESULTS SUMMARY ===

. count
  84

. display "Total IRF estimates: " r(N)
Total IRF estimates: 84

. tab outcome shock_type

                     | shock_type
             outcome |     sh_rr |     Total
---------------------+-----------+----------
          gini_broad |        21 |        21 
           gini_core |        21 |        21 
       gini_fincbtax |        21 |        21 
       gini_fsalaryx |        21 |        21 
---------------------+-----------+----------
               Total |        84 |        84 

. 
. * Export to CSV
. capture mkdir "$robust_tables"

. export delimited using "$robust_tables/lp_irf_results_rr_baseline.csv", r
> eplace
file /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Tables/lp_ir
> f_results_rr_baseline.csv saved

. display "Saved: $robust_tables/lp_irf_results_rr_baseline.csv"
Saved: /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Tables/lp_
> irf_results_rr_baseline.csv

. 
. ****************************************************
. * 5. Create IRF Plots
. ****************************************************
. 
. display _n "=== CREATING IRF PLOTS ==="

=== CREATING IRF PLOTS ===

. 
. levelsof outcome, local(outlist)
`"gini_broad"' `"gini_core"' `"gini_fincbtax"' `"gini_fsalaryx"'

. levelsof shock_type, local(shocklist)
`"sh_rr"'

. 
. foreach y of local outlist {
  2.     foreach shock of local shocklist {
  3. 
.         preserve
  4.         keep if outcome == "`y'" & shock_type == "`shock'"
  5. 
.         quietly {
  6.             local ylabel = outcome_label[1]
  7.         }
  8. 
.         * Short labels
.         if "`shock'" == "sh_rr" {
  9.             local shocklabel_short "RR shock"
 10.             local shockname "rr"
 11.         }
 12.         else {
 13.             local shocklabel_short "`shock'"
 14.             local shockname = subinstr("`shock'", "_", "", .)
 15.         }
 16. 
.         local plottitle "`ylabel' to `shocklabel_short'"
 17. 
.         gen zero_line = 0
 18. 
.         twoway ///
>             (rarea ci_upper ci_lower horizon, color(gs12) fintensity(30))
>  ///
>             (line coefficient horizon, lwidth(medthick) lcolor(navy)) ///
>             (line zero_line horizon, lpattern(dash) lcolor(black) lwidth(
> thin)) ///
>             , title("`plottitle'", size(med)) ///
>               xtitle("Horizon (quarters)", size(med)) ///
>               ytitle("", size(med)) ///
>               legend(order(2 "Point Estimate" 1 "95% Confidence Interval"
> ) ///
>                      cols(2) size(small)) ///
>               xlabel(0(5)20, grid) ///
>               ylabel(, grid) ///
>               scheme(s1mono) ///
>               plotregion(margin(small)) ///
>               graphregion(margin(medium) color(white))
 19. 
.         local filename "irf_`shockname'_`y'_baseline.png"
 20.         capture mkdir "$robust_figures"
 21.         graph export "$robust_figures/`filename'", replace width(2000)
 22. 
.         display "  Saved: `filename'"
 23. 
.         restore
 24.     }
 25. }
(63 observations deleted)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
file /Volumes/SSD
    PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Figures/irf_rr_gini_broa
    > d_baseline.png saved as PNG format
  Saved: irf_rr_gini_broad_baseline.png
(63 observations deleted)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
file /Volumes/SSD
    PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Figures/irf_rr_gini_core
    > _baseline.png saved as PNG format
  Saved: irf_rr_gini_core_baseline.png
(63 observations deleted)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
file /Volumes/SSD
    PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Figures/irf_rr_gini_finc
    > btax_baseline.png saved as PNG format
  Saved: irf_rr_gini_fincbtax_baseline.png
(63 observations deleted)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
(note:  named style med not found in class gsize, default attributes
    used)
file /Volumes/SSD
    PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Figures/irf_rr_gini_fsal
    > aryx_baseline.png saved as PNG format
  Saved: irf_rr_gini_fsalaryx_baseline.png

. 
. display _n "=== ALL PLOTS CREATED ==="

=== ALL PLOTS CREATED ===

. 
. display _n "========================================"

========================================

. display "LOCAL PROJECTIONS (RR baseline) COMPLETE"
LOCAL PROJECTIONS (RR baseline) COMPLETE

. display "========================================"
========================================

. display "Results table: $robust_tables/lp_irf_results_rr_baseline.csv"
Results table: /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Ta
> bles/lp_irf_results_rr_baseline.csv

. display "IRF plots:    $robust_figures/irf_*_baseline.png"
IRF plots:    /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/Fig
> ures/irf_*_baseline.png

. display "========================================" _n
========================================


. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp3-EnergyIneq/Code/Robust/03_l
> ocal_projections_rr_baseline.log
  log type:  text
 closed on:  20 Jan 2026, 12:17:17
---------------------------------------------------------------------------
